[
  {
    "Id": "5f064346-c5ee-4c85-a9d3-141f681953f2",
    "Name": "Dependency-Injection",
    "Description": "Topics related to implementing and managing dependency injection in .NET applications, including service lifetime management, container configuration, and best practices for loose coupling."
  },
  {
    "Id": "a6e14c7b-5321-463d-bdd9-6718ee40d775",
    "Name": "LINQ-and-Collections",
    "Description": "Discussions about Language Integrated Query (LINQ), including query optimization, collection handling, and advanced techniques for data manipulation in .NET applications."
  },
  {
    "Id": "2b8a891c-e627-40bd-8cdd-bfd0655f0fc7",
    "Name": "Microservices-Architecture",
    "Description": "Content covering microservices design patterns, implementation strategies, service communication, and deployment considerations in distributed systems."
  },
  {
    "Id": "b09d09f3-a249-4f48-841f-eecd5fd3ec93",
    "Name": "Error-Handling-Patterns",
    "Description": "Resources and discussions about implementing robust error handling, exception management, and logging strategies in .NET applications."
  },
  {
    "Id": "8ab0d353-2dcf-47e9-af14-9c8a66efa2ac",
    "Name": "Entity-Framework-Core",
    "Description": "Information about Entity Framework Core ORM, including performance optimization, query strategies, and database interaction patterns."
  },
  {
    "Id": "ff453f57-c9ad-4914-8e76-794b5b917ef8",
    "Name": "JavaScript",
    "Description": "A versatile, high-level programming language commonly used for web development, supporting both front-end and back-end applications."
  },
  {
    "Id": "31177cd3-13f4-44d2-b317-ab3f81aedc55",
    "Name": "Python",
    "Description": "A powerful, easy-to-read programming language popular for web development, data science, AI, and scripting."
  },
  {
    "Id": "af9a2024-9340-4451-84ad-b093ad05a7e1",
    "Name": "React",
    "Description": "A JavaScript library for building fast and interactive user interfaces, maintained by Facebook and a strong community."
  },
  {
    "Id": "93692d51-2d0c-4a57-8c42-fee1be6fa3ba",
    "Name": "CSharp",
    "Description": "A modern, object-oriented programming language developed by Microsoft, widely used for developing applications on the .NET platform."
  },
  {
    "Id": "3be97903-3d50-4c29-ac9e-b2fdc84602ba",
    "Name": "TypeScript",
    "Description": "A strongly-typed superset of JavaScript that compiles to clean JavaScript code and improves maintainability in large projects."
  },
  {
    "Id": "5bd996b0-ae55-4049-8159-7c513f3c8370",
    "Name": "Java",
    "Description": "A class-based, object-oriented programming language designed to have as few implementation dependencies as possible, widely used in enterprise and mobile development."
  },
  {
    "Id": "d2501bb3-3806-435d-bde9-30ef5e3c759b",
    "Name": "HTML",
    "Description": "The standard markup language for creating web pages and web applications."
  },
  {
    "Id": "332c883e-7890-4286-9dd3-cb5ab81f4a81",
    "Name": "CSS",
    "Description": "A stylesheet language used for describing the presentation of a document written in HTML or XML."
  },
  {
    "Id": "ea5c4859-1ff2-4804-9d82-eb498397d6ba",
    "Name": "Angular",
    "Description": "A platform and framework for building single-page client applications using HTML and TypeScript, developed by Google."
  },
  {
    "Id": "686a2ca8-742e-4659-833e-d7bbd9c7d310",
    "Name": "Vue",
    "Description": "A progressive JavaScript framework for building user interfaces and single-page applications."
  },
  {
    "Id": "f8b2bf6d-bf81-44e7-912a-7670c92b5e18",
    "Name": "SQL",
    "Description": "A domain-specific language used in programming and managing relational databases."
  }
]